app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('Abigail Johanna Ruales', 'rualesabigail09@gmail.com', '$2y$10$euogKNxYBkrlI4uuZHb6yOidyS/rxbBsMYoA8dGWu9Xy80PbD3TBW', 'student', '2025-09-12 03:19:23', '2025-09-12 03:19:23')
---
    public function registerSubmit()
    {
        $userModel = new UserModel();

        $data = [
            'name'     => $this->request->getPost('name'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'     => $this->request->getPost('role'),
        ];

        $userModel->save($data);