app/Controllers/Auth.php

    public function login()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'GET') {
            return view('auth/login');
        }

        if ($this->request->getMethod() === 'POST') {
            if (!$this->validate([
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]'
            ])) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            }

            $userModel = new UserModel();
            $email     = $this->request->getPost('email');
            $password  = $this->request->getPost('password');
            $user      = $userModel->findUserByEmail($email);
---
SELECT *
FROM `users`
WHERE `email` = 'rualesabigail09@gmail.com'
 LIMIT 1

    public function dashboard()
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $db        = \Config\Database::connect();
        $userModel = new UserModel();

        $userId   = $session->get('user_id');
        $userRole = strtolower($session->get('user_role'));
        $user     = $userModel->find($userId);

        $users = [];
        $courses = [];
        $deadlines = [];
        $enrolledCourses = [];
        $materials = [];

        try {
            // ADMIN
            if ($userRole === 'admin') {
                $users = $userModel->select('id, name, email, role')->findAll();

                if ($this->tableExists('courses')) {
                    $courses = $db->table('courses')->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT `id`, `name`, `email`, `role`
FROM `users`
SELECT *
FROM `courses`

                // Get all materials for admin
                if ($this->tableExists('materials')) {
                    $materialModel = new MaterialModel();
                    $materials = $db->table('materials')
                        ->select('materials.*, courses.title as course_name')
                        ->join('courses', 'courses.id = materials.course_id')
                        ->orderBy('materials.created_at', 'DESC')
                        ->limit(5)
                        ->get()
                        ->getResultArray();
---
SELECT `materials`.*, `courses`.`title` as `course_name`
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
ORDER BY `materials`.`created_at` DESC
 LIMIT 5

            // TEACHER
            elseif ($userRole === 'teacher') {
                if ($this->tableExists('courses')) {
                    $courses = $db->table('courses')
                        ->where('instructor_id', $userId)
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '2'


                // Get materials for teacher's courses
                if ($this->tableExists('materials')) {
                    $materials = $db->table('materials')
                        ->select('materials.*, courses.title as course_name')
                        ->join('courses', 'courses.id = materials.course_id')
                        ->where('courses.instructor_id', $userId)
                        ->orderBy('materials.created_at', 'DESC')
                        ->limit(5)
                        ->get()
                        ->getResultArray();
---
SELECT `materials`.*, `courses`.`title` as `course_name`
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
WHERE `courses`.`instructor_id` = '2'
ORDER BY `materials`.`created_at` DESC
 LIMIT 5

            // STUDENT
            elseif ($userRole === 'student') {
                if ($this->tableExists('courses')) {
                    $courses = $db->table('courses')
                        ->select('id, title, description')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `title`, `description`
FROM `courses`


                if ($this->tableExists('enrollments')) {
                    // Get enrolled courses
                    $enrolledCourses = $db->table('enrollments')
                        ->select('courses.id, courses.title, courses.description')
                        ->join('courses', 'enrollments.course_id = courses.id')
                        ->where('enrollments.user_id', $userId)
                        ->get()
                        ->getResultArray();
---
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '3'

    public function manageUsers()
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $userRole = strtolower($session->get('user_role'));
        if ($userRole !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Access denied. Admin only.');
        }

        $userModel = new UserModel();

        // Get all users (including deleted ones so they can be restored)
        // Users with status 'deleted' will still appear in the table with a "Restore" button
        $db = \Config\Database::connect();

        // Get all users - including deleted ones so admin can restore them
        $users = $db->table('users')
                    ->orderBy('created_at', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC