app/Models/MaterialModel.php

SELECT `materials`.*, `courses`.`title` as `course_name`
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
JOIN `enrollments` ON `enrollments`.`course_id` = `materials`.`course_id`
WHERE `enrollments`.`user_id` = '3'
ORDER BY `materials`.`created_at` DESC
---
    public function getMaterialsForEnrolledCourses($user_id)
    {
        return $this->select('materials.*, courses.title as course_name')
                    ->join('courses', 'courses.id = materials.course_id')
                    ->join('enrollments', 'enrollments.course_id = materials.course_id')
                    ->where('enrollments.user_id', $user_id)
                    ->orderBy('materials.created_at', 'DESC')
                    ->findAll();