app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 3
AND `is_read` = 0
---
    public function getUnreadCount(int $userId): int
    {
        return $this->where(['user_id' => $userId, 'is_read' => 0])->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = 3
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser(int $userId, int $limit = 5): array
    {
        return $this->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll($limit);